import math

k = 1 + 20  # Номер команди 1

# а) Рівноймовірні символи
h_uniform = math.log2(k)

# б) За геом. прогресією
# Створюємо список ймовірностей та нормалізуємо їх, щоб сума була 1
probs = [(1 / 2) ** i for i in range(1, k)]
probs.append(1 - sum(probs))  # Останній елемент "добирає" суму до 1

h_shannon = -sum(p * math.log2(p) for p in probs if p > 0)

# Задача 2: Недовантаженість
redundancy = h_uniform - h_shannon

print(f"--- Результати Частини 1.1 ---")
print(f"Кількість символів (k): {k}")
print(f"а) Ентропія Хартлі (Рівноймовірні символи): {h_uniform:.4f} біт/символ")
print(f"б) Ентропія Шеннона (Геометрична прогресія): {h_shannon:.4f} біт/символ")
print(f"Задача 2: Недовантаженість: {redundancy:.4f} біт/символ")